Revit 2026 API

# RoutingCondition Constructor

---

Creates a new RoutingCondition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RoutingCondition(
	double diameter
)
```
```vb
Public Sub New (
	diameter As Double
)
```
```cpp
public:
RoutingCondition(
	double diameter
)
```
```fsharp
new :
        diameter : float -> RoutingCondition
```

#### Parameters

diameter Double
     The diameter of a routing segment.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The given value for diameter must be greater than 0 and no more than 30000 feet. |

#### Reference

RoutingCondition Class

Autodesk.Revit.DB Namespace